.cf.xml/Catalogs/обм_ВходящиеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>обм_ВходящиеСообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>HTTPМетод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтносительныйURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>254</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.общ_ПримитивныйТип</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникПараметра</Name>
							<Type>
								<v8:Type>cfg:EnumRef.обм_ВходящиеСообщения_ИсточникиПараметров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

.cf.xml/Catalogs/обм_ВходящиеСообщения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Статусы.Параметры.УстановитьЗначениеПараметра("ВходящееСообщение", Объект.Ссылка);
	
	ПакетыДанных.Параметры.УстановитьЗначениеПараметра("ВходящееСообщение", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Статусы.Параметры.УстановитьЗначениеПараметра("ВходящееСообщение", Объект.Ссылка);
	Элементы.Статусы.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПакетыДанныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ПакетыДанных_Приемник Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Приемник);
		
	КонецЕсли;
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ВходящееСообщение_СохранитьВФайл(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	параметрыСообщения = Новый Структура("Файл_Имя, Файл_Расширение, Content-Type");
	параметрыСообщения = ПараметрыВходящегоСообщения(Объект.Ссылка, параметрыСообщения);
	
	ЗаписатьКакДвоичныеДанные = Ложь;
	Если ЗначениеЗаполнено(параметрыСообщения.Файл_Имя) Тогда
		Диалог.ПолноеИмяФайла = параметрыСообщения.Файл_Имя;
		Если параметрыСообщения.Файл_Расширение = ".xls" Тогда
			ЗаписатьКакДвоичныеДанные = Истина;
			
		КонецЕсли;
		
	ИначеЕсли 	параметрыСообщения.Content_type = "application/json" 
				Или параметрыСообщения.Content_type = "text/json" Тогда 
		Диалог.Расширение = "json";
		
	ИначеЕсли параметрыСообщения.Content_type = "application/xml" Тогда 
		Диалог.Расширение = "xml";
		
	ИначеЕсли параметрыСообщения.Content_type = "application/octet-stream" Тогда 
		Диалог.Расширение = "bin";
		ЗаписатьКакДвоичныеДанные = Истина;
		
	ИначеЕсли СтрНайти(параметрыСообщения.Content_type, "text/plain") Тогда 
		Диалог.Расширение = "txt";
		
	Иначе
		Диалог.Расширение = "txt";
	
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Диалог.ПолноеИмяФайла) Тогда
		Диалог.ПолноеИмяФайла = 
			СтрШаблон(
				"%1.%2",
				Объект.Наименование,
				Диалог.Расширение
				);
		
	КонецЕсли;
		
	Диалог.МножественныйВыбор = Ложь;
	
	ОбещаниеВыбораФайлов = Диалог.ВыбратьАсинх();
	ВыбранныеФайлы = Ждать ОбещаниеВыбораФайлов;
	
	Если ТипЗнч(ВыбранныеФайлы) <> Тип("Массив") Тогда 
		Возврат;
		
	КонецЕсли;
	
	ПутьКФайлу = ВыбранныеФайлы[0];
	
	Если ЗаписатьКакДвоичныеДанные Тогда
		ОбещаниеЗаписи = Base64Значение(Объект.Запрос).ЗаписатьАсинх(ПутьКФайлу);
		
	Иначе
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(Объект.Запрос);
		ОбещаниеЗаписи = ТекстовыйДокумент.ЗаписатьАсинх(ПутьКФайлу);
		
	КонецЕсли;
	
	Ждать ОбещаниеЗаписи;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПараметрыВходящегоСообщения(пВходящееСсылка, пИменаПараметров)
	
	Возврат Справочники.обм_ВходящиеСообщения.Параметры(пВходящееСсылка, пИменаПараметров);
	
КонецФункции

#КонецОбласти
